<template>
  <div class="hello">
    <h1>Задача</h1>
    <ul>
      <li>Вывести данные в виде таблицы.</li>
      <li>Реализовать живой поиск.</li>
      <li>Вывести поле Итого - сумму по всем элементам поля currency.</li>
      <li>Реализовать сортировку данных по полям name, location, currency.</li>
      <li>Реализовать живое редактирование данных в каждом строке таблицы (Поле Итого должно пересчитываться в зависимости от введенных новых данных).
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'Home',
}
</script>


